#+PROPERTY: header-args:jupyter-python  :session aoc :kernel python
#+PROPERTY: header-args    :pandoc t

** Part 1
#+begin_src jupyter-python
  data = "165,1,255,31,87,52,24,113,0,91,148,254,158,2,73,153"
  lengths = [int(length) for length in data.split(",")]
  def hash(lengths):
      knots = deque(range(256))
      total = 0
      for idx, length in enumerate(lengths):
          new = deque([knots.popleft() for _ in range(length)])
          new.reverse()
          knots = knots + new
          knots.rotate(-idx)
          total += length + idx
      knots.rotate(total)
      return knots
  knots = hash(lengths)
  knots.popleft() * knots.popleft()
#+end_src

#+RESULTS:
: 4114
